import numpy as np
import tkinter as tk
from perceptron.GUI import GUI
from perceptron.NeuralNetwork import NeuralNetwork

input_size = 12
hidden_size = [11, 11]
output_size = 3
learning_rate = 0.1
epochs = 2000
rangeWeights = 1

inputs = np.array([[2.3, 6.7, 2.5, 3.6, 2, 1, 0.22, 2.9, 280, 1, 6, "Middle"],  # Грузовой автомобиль
                   [2.7, 13.5, 4.3, 5.5, 60, 1, 0.22, 4.2, 380, 2, 8, "Big"],  # Автобус
                   [2.1, 4.0, 1.3, 1.3, 5, 0, 0.16, 2.2, 180, 0, 4, "Little"],  # Легковой автомобиль
                   [2.0, 4.8, 1.3, 1.5, 5, 0, 0.2, 2.2, 190, 0, 4, "Little"],  # Легковой автомобиль
                   [2.5, 12.0, 4.1, 5.0, 50, 1, 0.22, 4.0, 350, 2, 8, "Big"],  # Автобус
                   [2.7, 14.0, 3.9, 5.4, 55, 1, 0.22, 4.2, 380, 2, 8, "Big"],  # Автобус
                   [2.2, 6.4, 2.3, 3.6, 2, 1, 0.23, 2.8, 250, 1, 6, "Middle"],  # Грузовой автомобиль
                   [2.7, 14.0, 3.9, 5.4, 55, 1, 0.22, 4.2, 380, 2, 8, "Big"],  # Автобус
                   [2.1, 6.5, 2.2, 3.7, 2, 1, 0.22, 2.4, 270, 1, 6, "Middle"],  # Грузовой автомобиль
                   [2.1, 6.5, 2.2, 3.7, 2, 1, 0.22, 2.4, 270, 1, 6, "Middle"],  # Грузовой автомобиль
                   [2.1, 4.7, 1.5, 1.4, 5, 0, 0.2, 2.2, 200, 0, 4, "Little"],  # Легковой автомобиль
                   [1.8, 4.5, 1.4, 1.2, 5, 0, 0.10, 1.9, 170, 0, 4, "Little"],  # Легковой автомобиль
                   [2.2, 6.3, 2.4, 3.4, 2, 1, 0.22, 2.6, 240, 1, 6, "Middle"],  # Грузовой автомобиль
                   [2.0, 4.8, 1.3, 1.5, 5, 0, 0.2, 2.2, 190, 0, 4, "Little"],  # Легковой автомобиль
                   [2.1, 4.3, 1.4, 1.2, 5, 0, 0.2, 2.0, 120, 0, 4, "Little"],  # Легковой автомобиль
                   [2.0, 4.5, 1.5, 1.5, 5, 0, 0.18, 2.0, 150, 0, 4, "Little"],  # Легковой автомобиль
                   [2.9, 14.0, 4.2, 5.5, 40, 1, 0.22, 4.2, 380, 2, 8, "Big"],  # Автобус
                   [2.7, 16.0, 4.1, 5.3, 60, 1, 0.22, 4.1, 370, 2, 8, "Big"],  # Автобус
                   [2.0, 6.6, 2.3, 3.5, 2, 1, 0.23, 2.8, 230, 1, 6, "Middle"],  # Грузовой автомобиль
                   [2.1, 6.5, 2.2, 3.7, 2, 1, 0.22, 2.4, 270, 1, 6, "Middle"],  # Грузовой автомобиль
                   [2.8, 15.0, 4.3, 5.4, 60, 1, 0.22, 4.0, 350, 2, 8, "Big"],  # Автобус
                   [2.2, 6.3, 2.3, 3.5, 2, 1, 0.21, 2.7, 240, 1, 6, "Middle"],  # Грузовой автомобиль
                   [2.1, 4.3, 1.4, 1.2, 5, 0, 0.2, 2.0, 120, 0, 4, "Little"],  # Легковой автомобиль
                   [2.0, 6.0, 2.2, 3.5, 2, 1, 0.21, 2.7, 240, 1, 6, "Middle"],  # Грузовой автомобиль
                   [3.0, 15.0, 4.0, 5.2, 45, 1, 0.22, 4.1, 390, 2, 8, "Big"],  # Автобус
                   [2.6, 13.0, 4.2, 5.3, 55, 1, 0.22, 4.1, 370, 2, 8, "Big"],  # Автобус
                   [1.9, 4.5, 1.4, 1.2, 5, 0, 0.17, 2.3, 160, 0, 4, "Little"]], dtype=object)  # Легковой автомобиль

targets = np.array([[0, 1, 0],  # Грузовой автомобиль
                    [0, 0, 1],  # Автобус
                    [1, 0, 0],  # Легковой автомобиль
                    [1, 0, 0],  # Легковой автомобиль
                    [0, 0, 1],  # Автобус
                    [0, 0, 1],  # Автобус
                    [0, 1, 0],  # Грузовой автомобиль
                    [0, 0, 1],  # Автобус
                    [0, 1, 0],  # Грузовой автомобиль
                    [0, 1, 0],  # Грузовой автомобиль
                    [1, 0, 0],  # Легковой автомобиль
                    [1, 0, 0],  # Легковой автомобиль
                    [0, 1, 0],  # Грузовой автомобиль
                    [1, 0, 0],  # Легковой автомобиль
                    [1, 0, 0],  # Легковой автомобиль
                    [1, 0, 0],  # Легковой автомобиль
                    [0, 0, 1],  # Автобус
                    [0, 0, 1],  # Автобус
                    [0, 1, 0],  # Грузовой автомобиль
                    [0, 1, 0],  # Грузовой автомобиль
                    [0, 0, 1],  # Автобус
                    [0, 1, 0],  # Грузовой автомобиль
                    [1, 0, 0],  # Легковой автомобиль
                    [0, 1, 0],  # Грузовой автомобиль
                    [0, 0, 1],  # Автобус
                    [0, 0, 1],  # Автобус
                    [1, 0, 0]]) # Легковой автомобиль

nn = NeuralNetwork(input_size, hidden_size, output_size, rangeWeights)
inputs = nn.conversionToFloat(inputs)
nn.train(nn.normalize(inputs), targets, learning_rate, epochs)

inputs_mean = np.mean(inputs, axis=0)
inputs_std = np.std(inputs, axis=0)
root = tk.Tk()
gui = GUI(root, nn, inputs_mean, inputs_std)
root.mainloop()